cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/Письмо/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбщиеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыПисьма(знач ПриведенныйПочтовыйАдрес,
                                    знач Пароль = Неопределено)
	// Проверяет возможность отправления письма и если
	// это возможно - формирует параметры отправки
	//

	ПараметрыПисьма = Новый Структура;
	
	//Если ЗначениеЗаполнено(Пароль) Тогда
	//	ПараметрыПисьма.Вставить("Пароль", Пароль);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриведенныйПочтовыйАдрес) Тогда
		ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(АдресОтвета) Тогда
	//	ПараметрыПисьма.Вставить("АдресОтвета", АдресОтвета);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Тема) Тогда
		ПараметрыПисьма.Вставить("Тема", Объект.Тема);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Текст) Тогда
		ПараметрыПисьма.Вставить("Тело", Объект.Текст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипТекста) Тогда
		ПараметрыПисьма.Вставить("ТипТекста", Объект.ТипТекста);
	КонецЕсли;
	
	
	//Если ВложенияВПисьмо.Количество() > 0 Тогда
	//	Вложения = Новый Соответствие;
	//	Для Каждого ЭлементВложение Из ВложенияВПисьмо Цикл
	//		Если ЭлементВложение.Пометка Тогда
	//			ДвоичныеДанные = Новый ДвоичныеДанные(ЭлементВложение.Значение);
	//			Вложения.Вставить(ЭлементВложение.Представление, ДвоичныеДанные);
	//		Иначе
	//			Вложения.Вставить(ЭлементВложение.Представление, ЭлементВложение.Значение);
	//		КонецЕсли;
	//	КонецЦикла;
	//	ПараметрыПисьма.Вставить("Вложения", Вложения);
	//КонецЕсли;
	
	Возврат ПараметрыПисьма;
	
КонецФункции

&НаСервере
Функция ПолучитьПарольУчетнойЗаписи()
	
	Пароль = "";
	
	Запрос = Новый Запрос("ВЫБРАТь Пароль ИЗ Справочник.УчетныеЗаписиЭлектроннойПочты ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Пароль = Выборка.Пароль;
		
	КонецЕсли;
	
	Возврат Пароль;
	
КонецФункции

&НаКлиенте
Процедура ПослатьПисьмо(Команда)
	
	ОчиститьСообщения();
	
	Попытка
		ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Объект.Кому);
	Исключение
		Предупреждение(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	//Если ЗначениеЗаполнено(АдресОтвета) Тогда
	//	Попытка
	//		ПриведенныйАдресОтвета = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресОтвета);
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()), ЭтаФорма, "АдресОтвета");
	//		Возврат;
	//	КонецПопытки;
	//КонецЕсли;
	
	//Пароль = Неопределено;
	
	Пароль = ПолучитьПарольУчетнойЗаписи();

	ПараметрыПисьма = СформироватьПараметрыПисьма(ПриведенныйПочтовыйАдрес);
	
	Если ПараметрыПисьма = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка формирования параметров почтового сообщения'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(Объект.УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	//СохранитьАдресОтвета(АдресОтвета);
	Предупреждение(НСтр("ru = 'Сообщение успешно отправлено'"));

	Закрыть();
	
КонецПроцедуры

// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры
